In [1]:
import pandas as pd 
import numpy as np

In [2]:
dict = {'A':[12,34 , np.nan] , 'B':[45,65,78] , 'C':[np.nan , 89 , np.nan]}

In [3]:
df = pd.DataFrame(dict)

df

      A   B     C
0  12.0  45   NaN
1  34.0  65  89.0
2   NaN  78   NaN

In [5]:
print("\n filling values with a computed mean(mean of column 'b' here)\n" , '-'*60 ,sep='')
df.fillna(value=df['B'].mean() ,inplace = True ) #inplace = True used for saved changes
print(df)                                        #here the avg of b is used to fill nan. values

 filling values with a computed mean(mean of column 'b' here)
------------------------------------------------------------
           A   B          C
0  12.000000  45  62.666667
1  34.000000  65  89.000000
2  62.666667  78  62.666667

In [6]:
#create dataframe
data = {'Company':['GOOG' , 'GOOG' , 'MSFT' , 'MSFT' , 'FB' , 'FB'],
       'Person':['Sam' , 'Charlie' , 'Amy' , 'Vanesa' , 'Carl' , 'Sarah'],
       'Sales':[200,450,678,432,156,789],
       'Profit':[34,23,56,73,88,62]}

df = pd.DataFrame(data)
df

  Company   Person  Sales  Profit
0    GOOG      Sam    200      34
1    GOOG  Charlie    450      23
2    MSFT      Amy    678      56
3    MSFT   Vanesa    432      73
4      FB     Carl    156      88
5      FB    Sarah    789      62

# Groupby:

In [8]:
avg_sales = df.groupby('Company' , as_index = False)['Sales'].mean() #as index = False is used to show index.

print("\ngrouping by 'company' column  and lisitng mean sales\n" , '-'*50)
print(avg_sales)

grouping by 'company' column  and lisitng mean sales
 --------------------------------------------------
  Company  Sales
0      FB  472.5
1    GOOG  325.0
2    MSFT  555.0

In [11]:
total_sales = df.groupby('Company',as_index = False )[['Sales' , 'Profit']].sum()
print("\n groupping by the comapny and listing sum of sales and profit\n" , '-'*55)

print(total_sales)

 groupping by the comapny and listing sum of sales and profit
 -------------------------------------------------------
  Company  Sales  Profit
0      FB    945     150
1    GOOG    650      57
2    MSFT   1110     129

In [12]:
sales_stats = df.groupby('Company')[['Sales' , 'Profit']].agg(['mean' , 'sum'])

print("\ngroupping by 'comapny' and both sum and avg sales\n" , '-'*50)
print(sales_stats)          #agg stands for aggregate

groupping by 'comapny' and both sum and avg sales
 --------------------------------------------------
         Sales       Profit
          mean   sum   mean  sum
Company
FB       472.5   945   75.0  150
GOOG     325.0   650   28.5   57
MSFT     555.0  1110   64.5  129

In [13]:
#finding the largest value in each group.
#this produce sales and corresponding index    
df.groupby('Company')['Sales'].nlargest(1) # (1) is top(1)

Company
FB       5    789
GOOG     1    450
MSFT     2    678
Name: Sales, dtype: int64

In [14]:
#similarly we can check smallest by nsmallest(1)

let's learn about = 1.concat
                    2.merge
                    3.join

In [15]:
#create dataframe 
class_a = pd.DataFrame({'mat': [28,34,78,66],
                       'eng':[34,55,66,34,],
                       'sci': [45,67,77,44,],
                       'chem':[46,77,23,89]},
                      index = ['Ravi' , 'manan' , 'ram' , 'imam'])

print(class_a)

       mat  eng  sci  chem
Ravi    28   34   45    46
manan   34   55   67    77
ram     78   66   77    23
imam    66   34   44    89

In [16]:
class_b = pd.DataFrame({'mat': [26,34,78,36],
                       'eng':[34,75,56,34,],
                       'sci': [45,37,77,34,],
                       'chem':[49,77,23,89]},
                      index = ['Ram' , 'shan' , 'mridul' , 'zimam'])
print(class_b)

        mat  eng  sci  chem
Ram      26   34   45    49
shan     34   75   37    77
mridul   78   56   77    23
zimam    36   34   34    89

In [17]:
class_c = pd.DataFrame({'mat': [26,74,78,96],
                       'eng':[32,75,66,34,],
                       'sci': [45,35,77,39,],
                       'chem':[46,77,23,89]},
                      index = ['tarun' , 'tashan' , 'nanu' , 'miya'])

In [18]:
print(class_c)

        mat  eng  sci  chem
tarun    26   32   45    46
tashan   74   75   35    77
nanu     78   66   77    23
miya     96   34   39    89

In [19]:
#concatenation
all_student_marks = pd.concat([class_a , class_b, class_c] , axis = 0)
                              
print("\nafter concatenation along row\n" , '-'*50 , sep='')
print(all_student_marks)

after concatenation along row
--------------------------------------------------
        mat  eng  sci  chem
Ravi     28   34   45    46
manan    34   55   67    77
ram      78   66   77    23
imam     66   34   44    89
Ram      26   34   45    49
shan     34   75   37    77
mridul   78   56   77    23
zimam    36   34   34    89
tarun    26   32   45    46
tashan   74   75   35    77
nanu     78   66   77    23
miya     96   34   39    89

In [20]:
all_student_marks = pd.concat([class_a , class_b, class_c] , axis = 1)
                              
print("\nafter concatenation along column\n" , '-'*50 , sep='')
print(all_student_marks)

after concatenation along column
--------------------------------------------------
         mat   eng   sci  chem   mat   eng   sci  chem   mat   eng   sci  chem
Ravi    28.0  34.0  45.0  46.0   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
manan   34.0  55.0  67.0  77.0   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
ram     78.0  66.0  77.0  23.0   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
imam    66.0  34.0  44.0  89.0   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
Ram      NaN   NaN   NaN   NaN  26.0  34.0  45.0  49.0   NaN   NaN   NaN   NaN
shan     NaN   NaN   NaN   NaN  34.0  75.0  37.0  77.0   NaN   NaN   NaN   NaN
mridul   NaN   NaN   NaN   NaN  78.0  56.0  77.0  23.0   NaN   NaN   NaN   NaN
zimam    NaN   NaN   NaN   NaN  36.0  34.0  34.0  89.0   NaN   NaN   NaN   NaN
tarun    NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN  26.0  32.0  45.0  46.0
tashan   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN  74.0  75.0  35.0  77.0
nanu     NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN  78.0  66.0  77.0  23.0
miya     NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN  96.0  34.0  39.0  89.0

# MERGE

In [21]:
#in concet we can use two or more than two dataframe

In [22]:
player_id_name = pd.DataFrame({
    'ID':[25,30,35,40,45,50 , 55],
    'Name':['Ronaldo' , 'Messi' , 'Pele' , 'Maredona' ,'Harry' , 'Pogba' , 'Chhetri'],
    
})

print("Player Id and Name \n ================")
player_id_name

Player Id and Name
 ================

   ID      Name
0  25   Ronaldo
1  30     Messi
2  35      Pele
3  40  Maredona
4  45     Harry
5  50     Pogba
6  55   Chhetri

In [23]:
#merge will accept only two data frame

In [32]:
player_detail = pd.DataFrame({
    'ID':[25,30,45,50,55],
    'Age':[36,34,28,28,37],
    'Country':['Portugal' , 'Argentina' , 'England' , 'France' , 'India' ]
})

print('player details \n===============')

print(player_detail)

player details
===============
   ID  Age    Country
0  25   36   Portugal
1  30   34  Argentina
2  45   28    England
3  50   28     France
4  55   37      India

In [33]:
print("Dataset will be merged based on the matching id's  ============")
pd.merge(player_id_name, player_detail,on = 'ID')      #pd.df(df1 , df2 , on=based on)

Dataset will be merged based on the matching id's  ============

   ID     Name  Age    Country
0  25  Ronaldo   36   Portugal
1  30    Messi   34  Argentina
2  45    Harry   28    England
3  50    Pogba   28     France
4  55  Chhetri   37      India

# join

In [42]:
left = pd.DataFrame({'A':['A0' , 'A1' , 'A2'],
                    'B':['B0' , 'B1' , 'B2']},
                    index = ['k0' , 'k1' , 'k2'])


right = pd.DataFrame({'C':['C0' , 'C1' , 'C2'],
                     'D':['D0' , 'D1' , 'D2']},
                    index = ['k0' , 'k2' , 'k3'])

In [43]:
left

     A   B
k0  A0  B0
k1  A1  B1
k2  A2  B2

In [44]:
right

     C   D
k0  C0  D0
k2  C1  D1
k3  C2  D2

In [45]:
left.join(right)  #it will join on the basis of index.
                  #only the match index will be joined

     A   B    C    D
k0  A0  B0   C0   D0
k1  A1  B1  NaN  NaN
k2  A2  B2   C1   D1

In [46]:
left.join(right , how = 'outer')  #outer means keep everything from both left and right

      A    B    C    D
k0   A0   B0   C0   D0
k1   A1   B1  NaN  NaN
k2   A2   B2   C1   D1
k3  NaN  NaN   C2   D2

# apply function

In [47]:
df = pd.DataFrame({'Dept':[1,2,3,4,5,6,7,8,9,10],
                  'Emp_Name':['Rajesh' , 'shankar' , 'sindhu' , 'salman' , 'srk' , 'uday' , 'yash' , 'ram' , 'sham' , 'amy'],
                 'Salary':[4566,4567,3421,6743,5674,2389,6543,8765,1298,9872] })
df

   Dept Emp_Name  Salary
0     1   Rajesh    4566
1     2  shankar    4567
2     3   sindhu    3421
3     4   salman    6743
4     5      srk    5674
5     6     uday    2389
6     7     yash    6543
7     8      ram    8765
8     9     sham    1298
9    10      amy    9872

In [48]:
#define a function
def salary_hike(x):
    if(x > 3000):
        return np.ceil(x + (x* .30))
    else:
        return np.ceil( x * 1.5)

In [50]:
df['New salary'] = df['Salary'].apply(salary_hike)   #ceil will make the number round figure
print(df)  #here we are adding new column new salary and applying function on it

   Dept Emp_Name  Salary  New salary
0     1   Rajesh    4566      5936.0
1     2  shankar    4567      5938.0
2     3   sindhu    3421      4448.0
3     4   salman    6743      8766.0
4     5      srk    5674      7377.0
5     6     uday    2389      3584.0
6     7     yash    6543      8506.0
7     8      ram    8765     11395.0
8     9     sham    1298      1947.0
9    10      amy    9872     12834.0

In [52]:
#increased salary 
df['Increased salary'] = df['New salary'] - df['Salary']
df

   Dept Emp_Name  Salary  New salary  Increased salary
0     1   Rajesh    4566      5936.0            1370.0
1     2  shankar    4567      5938.0            1371.0
2     3   sindhu    3421      4448.0            1027.0
3     4   salman    6743      8766.0            2023.0
4     5      srk    5674      7377.0            1703.0
5     6     uday    2389      3584.0            1195.0
6     7     yash    6543      8506.0            1963.0
7     8      ram    8765     11395.0            2630.0
8     9     sham    1298      1947.0             649.0
9    10      amy    9872     12834.0            2962.0

In [53]:
print("\nsum of the column New salary is :" , df['New salary'].sum())

sum of the column New salary is : 70731.0

In [57]:
print("min and max of the column new salary are:" , df['New salary'].min() , "and" ,  df['New salary'].max())

min and max of the column new salary are: 1947.0 and 12834.0

In [58]:
# deletion sorting and list of column and rows name

In [59]:
print("\nname of columns\n" , '-'*20)

print(df.columns)

name of columns
 --------------------
Index(['Dept', 'Emp_Name', 'Salary', 'New salary', 'Increased salary'], dtype='object')

In [61]:
l = list(df.columns)  #here we stored column names in the variables
print("\ncolumn name in the list of strings for later manipulation:\n" , l)

column name in the list of strings for later manipulation:
 ['Dept', 'Emp_Name', 'Salary', 'New salary', 'Increased salary']

In [62]:
#delete column 
print("\ndeleting column \n" , '-'*30)
df.drop('Salary'  , axis = 1 , inplace= True) #axis = 1 column wise axis = 0 row wise 
df   #it is soft delete

deleting column
 ------------------------------

   Dept Emp_Name  New salary  Increased salary
0     1   Rajesh      5936.0            1370.0
1     2  shankar      5938.0            1371.0
2     3   sindhu      4448.0            1027.0
3     4   salman      8766.0            2023.0
4     5      srk      7377.0            1703.0
5     6     uday      3584.0            1195.0
6     7     yash      8506.0            1963.0
7     8      ram     11395.0            2630.0
8     9     sham      1947.0             649.0
9    10      amy     12834.0            2962.0

In [64]:
#you can delete by command 
#it is harsh delete 
print("\ndeleting column by 'del' command \n" , '-' * 25)
del df['Dept']
df   # not generally prefered this method

deleting column by 'del' command
 -------------------------

  Emp_Name  New salary  Increased salary
0   Rajesh      5936.0            1370.0
1  shankar      5938.0            1371.0
2   sindhu      4448.0            1027.0
3   salman      8766.0            2023.0
4      srk      7377.0            1703.0
5     uday      3584.0            1195.0
6     yash      8506.0            1963.0
7      ram     11395.0            2630.0
8     sham      1947.0             649.0
9      amy     12834.0            2962.0

In [65]:
df.sort_values(by = 'New salary' , ascending = False ) #ascending by default so to descend asscending = false

  Emp_Name  New salary  Increased salary
9      amy     12834.0            2962.0
7      ram     11395.0            2630.0
3   salman      8766.0            2023.0
6     yash      8506.0            1963.0
4      srk      7377.0            1703.0
1  shankar      5938.0            1371.0
0   Rajesh      5936.0            1370.0
2   sindhu      4448.0            1027.0
5     uday      3584.0            1195.0
8     sham      1947.0             649.0

In [66]:
#how to read and load a file into data frame

In [67]:
import pandas as pd

# load.csv file

all the files an be find im the below link

In [ ]:
# https://